OdRxDynamicLinker.getModule(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the specified abstract (platform-independent) module.

OdRxDynamicLinker.getModule(System.Int32,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the specified abstract (platform-independent) module.

OdRxDynamicLinker.getModuleCount
\details
Returns the count of loaded modules.

OdRxDynamicLinker.loadModuleObj(OdRxModule*,System.Boolean)
\details
Special internal method - used for non-standard module loading only

OdRxDynamicLinker.sysRegistry
\details
Returns a SmartPointer to the OdRxDictionary instance that created by OdInitialize.

OdRxDynamicLinker.sysServices
\details
Returns a SmartPointer to the OdDbSystemServices instance that is used for file creation and access.
\sa
odInitialize

OdRxDynamicLinker.loadApp(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Maps the specfied application name to the a module filename,
and loads that module.
\param applicationName [in]  TX application name.
\param silent [in]  If and only if true, no load status message will be printed.

OdRxDynamicLinker.unloadUnreferenced
\details
Unoads all unreferenced modules.

OdRxDynamicLinker.unloadModule(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Unoads the specified abstract (platform-independent) module.
\param moduleFileName [in]  Module filename to unload.

OdRxDynamicLinker.loadModule(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Loads the specified abstract (platform-independent) module.
\returns
Returns a SmartPointer to the abstract module object.
\param moduleFileName [in]  Module filename to load.
\param silent [in]  If true, no load status message will be printed.

OdRxDynamicLinker.removeReactor(OdRxDLinkerReactor*)
\details
Removes the specified reactor to the dynamic linker reactor chain.
\param pReactor [in]  Pointer to the reactor.

OdRxDynamicLinker.addReactor(OdRxDLinkerReactor*)
\details
Adds the specified reactor to the dynamic linker reactor chain.
\param pReactor [in]  Pointer to the reactor.